//Задание 4: Вынос JavaScript в отдельный файл
// файл открыть

console.log('Hello, World!');
console.log('Это сообщение для отладки');
console.warn('Это предупреждение');
console.error('Это сообщение об ошибке');




//Задание 2: Браузерный alert

alert("⚠️ ВНИМАНИЕ!\n\n" +
  "Обнаружены признаки мошенничества.\n" +
  "Никому не сообщайте свои пароли, коды и данные карты.\n\n" +
  "Если вы получили подозрительное сообщение — закройте страницу.");

/*Метод alert в JavaScript используется для отображения модального
 окна с текстовым сообщением. Это простой способ уведомить пользователя 
 о каком-либо событии или состоянии
 */


 //Задание 3: Комментарии в JavaScript

// Однострочный комментарий

/*Метод alert в JavaScript используется для отображения модального
 окна с текстовым сообщением. Это простой способ уведомить пользователя 
 о каком-либо событии или состоянии
 */